Pandas Course

In [1]:
import pandas as pd

In [2]:
pd.__version__
# This script checks the version of the pandas library installed in the environment.

'2.3.1'

Pandas Series and Series Operations

Series is a one-dimensional array, like object that can hold various data types, including integer, float and strings.

In [3]:
my_series_mixed = pd.Series([10,20,30,6.0,7.0,8.0,"Jan","Feb","Mar"], index=["a","b","c","d","e","f","g","h","i"])
my_series_mixed

a     10
b     20
c     30
d    6.0
e    7.0
f    8.0
g    Jan
h    Feb
i    Mar
dtype: object

In [4]:
type(my_series_mixed)

pandas.core.series.Series

In [5]:
my_series_int = pd.Series([10,20,30], index=["a","b","c"])
my_series_int

a    10
b    20
c    30
dtype: int64

In [6]:
type(my_series_int)

pandas.core.series.Series

In [7]:
my_series_float = pd.Series([6.0,7.0,8.0], index=["a","b","c"])
my_series_float

a    6.0
b    7.0
c    8.0
dtype: float64

In [8]:
type(my_series_float)

pandas.core.series.Series

In [9]:
my_series_month = pd.Series(["Jan","Feb","Mar"], index=["a","b","c"])
my_series_month

a    Jan
b    Feb
c    Mar
dtype: object

In [10]:
type(my_series_month)

pandas.core.series.Series

In [11]:
my_series_month

a    Jan
b    Feb
c    Mar
dtype: object

In [12]:
my_series_month["a"]  # Accessing the first element of the series

'Jan'

In [13]:
my_series_mixed["b":"d"] # Accessing a slice of the series from index 'b' to 'd'

b     20
c     30
d    6.0
dtype: object

In [14]:
my_series_int

a    10
b    20
c    30
dtype: int64

In [15]:
my_series_int + 5
# Adding 5 to each element in the integer series

a    15
b    25
c    35
dtype: int64

In [16]:
my_series_float

a    6.0
b    7.0
c    8.0
dtype: float64

In [17]:
my_series_float * 2
# Multiplying each element in the float series by 2

a    12.0
b    14.0
c    16.0
dtype: float64

In [18]:
my_series_float

a    6.0
b    7.0
c    8.0
dtype: float64

In [19]:
my_series_float / 2
# Dividing each element in the float series by 2

a    3.0
b    3.5
c    4.0
dtype: float64

In [20]:
my_series_float

a    6.0
b    7.0
c    8.0
dtype: float64

Series - Data Types

In [21]:
type(my_series_float)

# This returns the Python type of the object my_series_float.
#  It tells you that my_series_float is a Pandas Series object.
# <class 'pandas.core.series.Series'>

pandas.core.series.Series

In [22]:
my_series_float.dtype
# This returns type of the data inside the Series
# It tells you that the data stored in the Series is of type float64.

dtype('float64')

In [23]:
type(my_series_float["a"])

# This returns the type of a single element from the Series, not the Series itself.

numpy.float64

Series Methods

In [24]:
my_series_float.size 
# This returns the number of elements in the Series.

3

In [25]:
my_series_float.shape
# This returns the shape of the Series, which is a tuple representing its dimensions.
# For a 1D Series, it will return (n,), where n is the number of elements in the Series.

(3,)

In [26]:
my_series_mixed

a     10
b     20
c     30
d    6.0
e    7.0
f    8.0
g    Jan
h    Feb
i    Mar
dtype: object

In [27]:
my_series_mixed.head()
# This returns the first 5 elements of the Series. 
# If the Series has fewer than 5 elements, it returns all of them.

a     10
b     20
c     30
d    6.0
e    7.0
dtype: object

In [28]:
my_series_mixed.tail()
# This returns the last 5 elements of the Series. 
# If the Series has fewer than 5 elements, it returns all of them.

e    7.0
f    8.0
g    Jan
h    Feb
i    Mar
dtype: object

In [29]:
my_series_mixed.head(3)
# This returns the first 3 elements of the Series.

a    10
b    20
c    30
dtype: object

In [30]:
my_series_mixed.tail(3)
# This returns the last 3 elements of the Series.

g    Jan
h    Feb
i    Mar
dtype: object

Descriptive Statistics for Numeric Values

In [31]:
my_series_int

a    10
b    20
c    30
dtype: int64

In [32]:
my_series_int.describe()
# This provides a summary of statistics for the integer Series,
#  including count, mean, standard deviation, min, max, and quartiles.
#  Also displays the output data type of the series, float64.

count     3.0
mean     20.0
std      10.0
min      10.0
25%      15.0
50%      20.0
75%      25.0
max      30.0
dtype: float64

In [33]:
my_series_stats = pd.Series([81,93,98,89,88], index=["a","b","c","d","e"])
my_series_stats

a    81
b    93
c    98
d    89
e    88
dtype: int64

In [34]:
my_series_stats.describe()
# This provides a summary of statistics for the Series containing statistics,
#  including count, mean, standard deviation, min, max, and quartiles.
#  Also displays the output data type of the series, float64

count     5.000000
mean     89.800000
std       6.300794
min      81.000000
25%      88.000000
50%      89.000000
75%      93.000000
max      98.000000
dtype: float64

In [35]:
my_series_stats1 = pd.Series([10, 20, 30, 40, 50, 60, 70], index=["a","b","c","d","e","f","g"])
my_series_stats1

a    10
b    20
c    30
d    40
e    50
f    60
g    70
dtype: int64

In [36]:
my_series_stats1.describe()
# This provides a summary of statistics for the Series containing statistics,
#  including count, mean, standard deviation, min, max, and quartiles.
#  Also displays the output data type of the series, float64.

count     7.000000
mean     40.000000
std      21.602469
min      10.000000
25%      25.000000
50%      40.000000
75%      55.000000
max      70.000000
dtype: float64

In [37]:
my_series_stats.sort_values(ascending=True)
# This sorts the Series containing statistics in ascending order.
# The output will show the index and values sorted from lowest to highest.

a    81
e    88
d    89
b    93
c    98
dtype: int64

In [38]:
my_series_stats.sort_values(ascending=False)
# This sorts the Series containing statistics in descending order.
# The `ascending=False` parameter specifies that the sort should be in descending order.

c    98
b    93
d    89
e    88
a    81
dtype: int64

Data Frames - Key data structure in pandas library, for handling and analyzing complex data sets

In [39]:
data = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 30, 35],
        "City": ["New York", "Los Angeles", "Chicago"]}

In [40]:
data

{'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 30, 35],
 'City': ['New York', 'Los Angeles', 'Chicago']}

In [41]:
df_dict = pd.DataFrame(data)
# This creates a DataFrame from the dictionary `data`.

df_dict
# This displays the DataFrame created from the dictionary `data`.

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [42]:
data1 = {"Name": "Srinivas", "Age": 40, "City": "Hyderabad"}
# This is a dictionary with one row of data and not a column wise list for multiple rows.

In [43]:
data1
# This displays the dictionary `data1`.

{'Name': 'Srinivas', 'Age': 40, 'City': 'Hyderabad'}

In [44]:
df_dict1 = pd.DataFrame([data1])
# To create data frame for this single row dictionary, we wrap it in a list.

df_dict1
# This displays the DataFrame created from the single row dictionary `data1`.

       Name  Age       City
0  Srinivas   40  Hyderabad

In [45]:
data_list = [["Srinivas", 40, "Hyderabad"],["John", 30, "New York"], ["Alice", 25, "Los Angeles"]]

# This is a list with three array lists, not a dictionary.

In [46]:
data_list

[['Srinivas', 40, 'Hyderabad'],
 ['John', 30, 'New York'],
 ['Alice', 25, 'Los Angeles']]

In [47]:
df_list = pd.DataFrame(data_list, columns = ["Name", "Age", "City"])

In [48]:
df_list

       Name  Age         City
0  Srinivas   40    Hyderabad
1      John   30     New York
2     Alice   25  Los Angeles

Data Frames using Numpy Arrays

In [49]:
import numpy as np

In [50]:
data_array = np.array([[1,2,3],[4,5,6],[7,8,9]])

In [51]:
data_array

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [52]:
df_numpy_array = pd.DataFrame(data_array, columns=["Column1", "Column2", "Column3"])

In [53]:
df_numpy_array

   Column1  Column2  Column3
0        1        2        3
1        4        5        6
2        7        8        9

In [54]:
type(df_numpy_array)

pandas.core.frame.DataFrame

In [55]:
type(df_list)

pandas.core.frame.DataFrame

In [56]:
type(df_dict)

pandas.core.frame.DataFrame

In [57]:
type(df_dict1)

pandas.core.frame.DataFrame

Creating data frames from various file formats using CSV and Excel

In [58]:
data = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 30, 35],
        "City": ["New York", "Los Angeles", "Chicago"]}

data

df_new_dict = pd.DataFrame(data)
df_new_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

Writing the daframe to CSV File

In [59]:
# Writing the dataframe to CSV File
df_new_dict.to_csv("newdatadict.csv", index=False)

In [60]:
# Writing dataframe back from CSV file
df_read_newdatadict_csv = pd.read_csv("newdatadict.csv")

df_read_newdatadict_csv

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

Loading data from Excel File - Data Frame

In [61]:
df_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [62]:
# Loading data to Excel file - Data Frame
df_dict.to_excel("newdatadict.xlsx", index=False)

In [63]:
# Reading data from Excel file - Data Frame
df_dict_excel_read = pd.read_excel("newdatadict.xlsx")

df_dict_excel_read

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

Dataframe Operations

In [64]:
data = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 30, 35],
        "City": ["New York", "Los Angeles", "Chicago"]}

data

df_new_dict = pd.DataFrame(data)
df_new_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [65]:
df_new_dict.head()
# Fetching the first 5 rows of the DataFrame.

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [66]:
df_new_dict.head(2)

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [67]:
df_new_dict.tail()
# Fetching the last 5 rows of the DataFrame.

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [68]:
df_new_dict.tail(2)

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [69]:
# Selecting Specific Columns
df_new_dict[['Name','City']]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [70]:
type(df_new_dict[['Name','City']])
# Dataframe requires two square brackets to select multiple columns.

pandas.core.frame.DataFrame

In [71]:
df_new_dict[['Name']]
# Selecting a single column with two square brackets returns a DataFrame, while one bracket returns a Series.

      Name
0    Alice
1      Bob
2  Charlie

In [72]:
df_new_dict[['Name']].values
# This returns the values of the DataFrame as a NumPy array.

array([['Alice'],
       ['Bob'],
       ['Charlie']], dtype=object)

In [73]:
# Filtering DataFrame Rows

df_new_dict[df_new_dict["Age"]>25]

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [74]:
df_new_dict[df_new_dict["Name"] == "Alice"]

    Name  Age      City
0  Alice   25  New York

In [75]:
# Filtering DataFrame Rows with Multiple Conditions
df_new_dict[(df_new_dict["City"] == "New York") & (df_new_dict["Age"] > 30)]

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [76]:
# Filtering DataFrame Rows with Multiple Conditions
df_new_dict[(df_new_dict["City"] == "New York") | (df_new_dict["Age"] > 30)]

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [77]:
# Filtering DataFrame Rows with Multiple Conditions
df_new_dict[(df_new_dict["City"] == "New York") & (df_new_dict["Age"] < 30)]

    Name  Age      City
0  Alice   25  New York

In [78]:
df_new_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [79]:
selected_cities = ["New York", "Chicago"]
selected_cities

['New York', 'Chicago']

In [80]:
df_new_dict[df_new_dict["City"].isin (selected_cities)]
# Filtering rows where city is in the selected list of cities.

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [81]:
df_new_dict[df_new_dict["Name"].str.startswith("A")]
# Filtering rows where the "Name" starts with "A"

    Name  Age      City
0  Alice   25  New York

In [82]:
df_new_dict[df_new_dict["Name"].str.endswith("e")]
# Filtering rows where the "Name" ends with "e"

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [83]:
df_new_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [84]:
df_new_dict.iloc[0:2]
# Selecting the first two rows of the DataFrame using iloc.

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [85]:
df_new_dict

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [86]:
df_new_dict.loc[df_new_dict["Age"]>=30]
# Filtering rows where the "Age" is greater than or equal to 30
# loc is used for label-based indexing, allowing you to filter rows based on conditions applied to specific columns.

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [87]:
df_new_dict.loc[df_new_dict["Age"]>=30, ["Name","City"]]
# Filtering rows where the "Age" is greater than or equal to 30 and selecting specific columns "Name" and "City"

      Name         City
1      Bob  Los Angeles
2  Charlie      Chicago

Identifying and Handling Missing Data in Pandas DataFrames

In [88]:
# Inserting missing values in dataframe using numpy nan

import numpy as np
np.nan
# nan stands for "Not a Number" and is used to represent missing or undefined values in a DataFrame.

nan

In [89]:
data_nan = {"Name": ["Alice", "Bob", np.nan, "Charlie"],
        "Age": [25, np.nan,30, 35],
        "City": ["New York", "Los Angeles", "Chicago", np.nan]}

In [90]:
df_nan = pd.DataFrame(data_nan)

df_nan
# This creates a DataFrame with missing values represented by np.nan.

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2      NaN  30.0      Chicago
3  Charlie  35.0          NaN

In [91]:
# Checking for missing values in the DataFrame

df_nan.isnull()
# This returns a DataFrame of the same shape as df_nan, with True for missing values and False for non-missing values.

    Name    Age   City
0  False  False  False
1  False   True  False
2   True  False  False
3  False  False   True

In [92]:
df_nan.isnull().sum()
# This returns the count of missing values in each column of the DataFrame.

Name    1
Age     1
City    1
dtype: int64

Drop Missing Values

In [93]:
df_nan.dropna()
# This drops all rows with any missing values from the DataFrame.

    Name   Age      City
0  Alice  25.0  New York

In [94]:
df_nan
# This displays rows with missing values still present in the DataFrame.

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2      NaN  30.0      Chicago
3  Charlie  35.0          NaN

In [95]:
# To update original DataFrame with the changes made, you can use the `inplace=True` parameter, without creating a new DataFrame.

df_nan.dropna(inplace=True)

In [96]:
df_nan

    Name   Age      City
0  Alice  25.0  New York

In [97]:
data_nan = {"Name": ["Alice", "Bob", np.nan, "Charlie"],
        "Age": [25, np.nan,30, 35],
        "City": ["New York", "Los Angeles", "Chicago", np.nan]}

In [98]:
# Another way to drop missing values.

df_nan1 = pd.DataFrame(data_nan)

In [99]:
df_nan1

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2      NaN  30.0      Chicago
3  Charlie  35.0          NaN

In [100]:
df_nan1 = df_nan1.dropna()
# This drops all rows with any missing values from the DataFrame.

In [101]:
df_nan1
# This now displays the DataFrame after dropping rows with missing values.

    Name   Age      City
0  Alice  25.0  New York

In [102]:
data_nan = {"Name": ["Alice", "Bob", np.nan, "Charlie"],
        "Age": [25, np.nan,30, 35],
        "City": ["New York", "Los Angeles", "Chicago", np.nan]}

In [103]:
df_nan2 = pd.DataFrame(data_nan)

df_nan2
# This creates another DataFrame with missing values represented by np.nan.

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2      NaN  30.0      Chicago
3  Charlie  35.0          NaN

In [104]:
df_nan2.dropna(axis=1)

# This drops all columns with any missing values from the DataFrame.
# axis=0 refers to rows, while axis=1 refers to columns.

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [105]:
df_nan2.dropna(axis=0)
# This drops all rows with any missing values from the DataFrame. 
# axis=0 refers to rows, while axis=1 refers to columns.

    Name   Age      City
0  Alice  25.0  New York

Threshold Missing Values

In [106]:
data_nan = {"Name": ["Alice", "Bob", np.nan, "Charlie"],
        "Age": [25, np.nan,np.nan, 35],
        "City": ["New York", "Los Angeles", "Chicago", np.nan]}

In [107]:
data_nan

{'Name': ['Alice', 'Bob', nan, 'Charlie'],
 'Age': [25, nan, nan, 35],
 'City': ['New York', 'Los Angeles', 'Chicago', nan]}

In [108]:
df_nan = pd.DataFrame(data_nan)

df_nan

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2      NaN   NaN      Chicago
3  Charlie  35.0          NaN

In [109]:
df_nan.dropna(thresh=2)
# This drops rows that have fewer than 2 non-NA values.

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
3  Charlie  35.0          NaN

In [110]:
df_nan.dropna(thresh=3)
# This drops rows that have fewer than 3 non-NA values.

# Row 1: 3 Non-NA values, so it is retained.
# Row 2: 2 Non-NA values, so it is dropped.
# Row 3: 1 Non-NA value, so it is dropped.
# Row 4: 2 Non-NA values, so it is dropped.

    Name   Age      City
0  Alice  25.0  New York

Filling the missing values with appropriate data

In [111]:
df_nan

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2      NaN   NaN      Chicago
3  Charlie  35.0          NaN

In [112]:
# Filling the missing values with appropriate data i.e. 0
df_nan.fillna(0)
# This fills all missing values in the DataFrame with 0.

      Name   Age         City
0    Alice  25.0     New York
1      Bob   0.0  Los Angeles
2        0   0.0      Chicago
3  Charlie  35.0            0

In [113]:
df_nan

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2      NaN   NaN      Chicago
3  Charlie  35.0          NaN

Filling the missing values with Mean

In [114]:
# Filling the missing values with mean of the column

# 25+35 = 60/2 = 30

df_nan.fillna(df_nan.mean(numeric_only=True))

# This fills the missing values in the DataFrame with the mean of each column, ignoring non-numeric columns.

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2      NaN  30.0      Chicago
3  Charlie  35.0          NaN

In [115]:
df_nan.fillna(df_nan.mean(numeric_only=True), inplace=True)

In [116]:
df_nan

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2      NaN  30.0      Chicago
3  Charlie  35.0          NaN

Filling the missing values with String

In [117]:
df_nan.fillna("Unknown")

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Unknown  30.0      Chicago
3  Charlie  35.0      Unknown

In [118]:
df_nan.fillna("Unknown",inplace=True)

In [119]:
df_nan

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Unknown  30.0      Chicago
3  Charlie  35.0      Unknown

In [120]:
data_nan1 = {"Name": ["Alice", "Bob", np.nan, "Charlie"],
        "Age": [25, np.nan,np.nan, 35],
        "City": ["New York", "Los Angeles", "Chicago", np.nan]}

In [121]:
data_nan1

{'Name': ['Alice', 'Bob', nan, 'Charlie'],
 'Age': [25, nan, nan, 35],
 'City': ['New York', 'Los Angeles', 'Chicago', nan]}

In [122]:
df_nan1 = pd.DataFrame(data_nan1)

In [123]:
df_nan1

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2      NaN   NaN      Chicago
3  Charlie  35.0          NaN

In [124]:
# Filling the missing numeric values with median.

# median = when we two numbers, average is considered as median
df_nan1.fillna(df_nan1.median(numeric_only=True))

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2      NaN  30.0      Chicago
3  Charlie  35.0          NaN

In [125]:
# Filling the missing numeric values with Maximum Value.
df_nan1.fillna(df_nan1.max(numeric_only=True))

      Name   Age         City
0    Alice  25.0     New York
1      Bob  35.0  Los Angeles
2      NaN  35.0      Chicago
3  Charlie  35.0          NaN

In [126]:
# Filling missing values with min value

df_nan1.fillna(df_nan1.min(numeric_only=True))

      Name   Age         City
0    Alice  25.0     New York
1      Bob  25.0  Los Angeles
2      NaN  25.0      Chicago
3  Charlie  35.0          NaN

In [127]:
df_nan1

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2      NaN   NaN      Chicago
3  Charlie  35.0          NaN

In [128]:
# Forward Filling

# df_nan1.fillna(method="ffill")  #deprecated Method

df_nan1.ffill()

# It checks B1 with B0 -> 25 is filled
# It checks B2 with B1 -> 25 is filled

      Name   Age         City
0    Alice  25.0     New York
1      Bob  25.0  Los Angeles
2      Bob  25.0      Chicago
3  Charlie  35.0      Chicago

In [129]:
# Backward Filling

# df_nan1.fillna(method="bfill") #Deprecated Method

df_nan1.bfill()

# It checks B3 with B2 -> 35 is filled
# It checks B2 with B1 -> 25 is filled

      Name   Age         City
0    Alice  25.0     New York
1      Bob  35.0  Los Angeles
2  Charlie  35.0      Chicago
3  Charlie  35.0          NaN

Data Manipulation using loc and iloc

In [130]:
# Exploring loc method for label-based indexing

data_loc = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 18,38],
        "City": ["New York", "Los Angeles", "Chicago"]}

In [131]:
df = pd.DataFrame(data_loc)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [132]:
df.loc[1]
# This retrieves the row at index 1 from the DataFrame, which corresponds to Bob's data.

Name            Bob
Age              18
City    Los Angeles
Name: 1, dtype: object

In [133]:
df.loc[0:2]
# This selects rows with index labels 0 to 2 from the DataFrame.

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [134]:
df.loc[[1,2]]
# Selecting specific rows by their index labels, in this case, rows with index 1 and 2.

      Name  Age         City
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [135]:
df.loc[[0,2],["Name","City"]]
# This selects specific rows (0 and 2) and specific columns ("Name" and "City") from the DataFrame.

      Name      City
0    Alice  New York
2  Charlie   Chicago

In [136]:
# Exploring iloc method for position-based indexing 

data_iloc = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 18,38],
        "City": ["New York", "Los Angeles", "Chicago"]}

In [137]:
df_iloc = pd.DataFrame(data_iloc)
df_iloc

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [138]:
df.iloc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [139]:
df.iloc[1]

Name            Bob
Age              18
City    Los Angeles
Name: 1, dtype: object

In [140]:
df.loc[0:2]
# This selects rows with index labels 0 to 2 from the DataFrame.

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [141]:
df.iloc[0:2]
# This selects rows 0 to 1 , excluding row 2, from the DataFrame.

    Name  Age         City
0  Alice   25     New York
1    Bob   18  Los Angeles

In [142]:
df.loc[[0,2]]
# This selects rows with index labels 0 and 2 from the DataFrame.

      Name  Age      City
0    Alice   25  New York
2  Charlie   38   Chicago

In [143]:
df.iloc[[0,2]]
# This selects rows at positions 0 and 2 from the DataFrame.

      Name  Age      City
0    Alice   25  New York
2  Charlie   38   Chicago

In [144]:
df.loc[[0,2],["Name","City"]]
# This selects specific rows (0 and 2) and specific columns ("Name" and "City") from the DataFrame.

      Name      City
0    Alice  New York
2  Charlie   Chicago

In [145]:
df.iloc[[0,2],[0,2]]
# This selects specific rows (0 and 2) and specific columns (0 and 2) from the DataFrame based on their positions.

      Name      City
0    Alice  New York
2  Charlie   Chicago

Conditional Operations - Dataframes

In [146]:
data_cond = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 18,38],
        "City": ["New York", "Los Angeles", "Chicago"]}

In [147]:
df_cond = pd.DataFrame(data_cond)
df_cond

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [148]:
# Condition selection based on Age
df_cond[df_cond["Age"]>20]

      Name  Age      City
0    Alice   25  New York
2  Charlie   38   Chicago

In [149]:
df_cond[df_cond["City"]=="Chicago"]

      Name  Age     City
2  Charlie   38  Chicago

In [150]:
# OR Conditional selection based on City or Age
df_cond[(df_cond["City"]=="Chicago") | (df_cond["Age"]>20)]

      Name  Age      City
0    Alice   25  New York
2  Charlie   38   Chicago

In [151]:
# AND Conditional selection based on City and Age
df_cond[(df_cond["City"]=="Chicago") & (df_cond["Age"]>20)]

      Name  Age     City
2  Charlie   38  Chicago

Dataframe query method

In [152]:
df_cond

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [153]:
# query method for conditional selection
df_cond.query("Age > 20")

      Name  Age      City
0    Alice   25  New York
2  Charlie   38   Chicago

In [154]:
df_cond.query("Age > 20 and City == 'Chicago'")

      Name  Age     City
2  Charlie   38  Chicago

In [155]:
df_cond.query("Age > 20 or City == 'Chicago'")

      Name  Age      City
0    Alice   25  New York
2  Charlie   38   Chicago

In [156]:
# If age * 2 > 50 - display the rows

df_cond

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [157]:
df_cond.query("Age * 2 >= 50")

      Name  Age      City
0    Alice   25  New York
2  Charlie   38   Chicago

Sorting and Ranking Data in Pandas Dataframes

In [158]:
data_sort = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 18,38],
        "City": ["New York", "Los Angeles", "Chicago"]}

In [159]:
df_sort = pd.DataFrame(data_sort)
df_sort

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [160]:
# Sorting by Ascending order of Age
df.sort_values("Age", ascending=True)

      Name  Age         City
1      Bob   18  Los Angeles
0    Alice   25     New York
2  Charlie   38      Chicago

In [161]:
# Sorting by Descending order of Age
df_sort.sort_values("Age", ascending=False)

      Name  Age         City
2  Charlie   38      Chicago
0    Alice   25     New York
1      Bob   18  Los Angeles

In [162]:
# Sorting by multiple columns
df_sort.sort_values(["City","Name"],ascending=True)

      Name  Age         City
2  Charlie   38      Chicago
1      Bob   18  Los Angeles
0    Alice   25     New York

Ranking the columns in dataframes

In [163]:
data_rank = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 18,38],
        "City": ["New York", "Los Angeles", "Chicago"]}

In [164]:
data_rank

{'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 18, 38],
 'City': ['New York', 'Los Angeles', 'Chicago']}

In [165]:
df_rank = pd.DataFrame(data_rank)
df_rank

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [166]:
df_rank["Age"].rank()

# In Pandas, rank() is assigned to values. smallest value gets rank 1, next smallest gets rank 2, and so on.

0    2.0
1    1.0
2    3.0
Name: Age, dtype: float64

In [167]:
# Tied Values

data_rank = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 25,38],
        "City": ["New York", "Los Angeles", "Chicago"]}

df_rank = pd.DataFrame(data_rank)
df_rank

      Name  Age         City
0    Alice   25     New York
1      Bob   25  Los Angeles
2  Charlie   38      Chicago

In [168]:
df_rank["Age"].rank(method='min')

# The 'min' method assigns the minimum rank to all tied values.

0    1.0
1    1.0
2    3.0
Name: Age, dtype: float64

In [169]:
df_rank["Age"].rank(method="average")

0    1.5
1    1.5
2    3.0
Name: Age, dtype: float64

Combining and merging data frames

In [170]:
data_one = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 18,38],
        "City": ["New York", "Los Angeles", "Chicago"]}

In [171]:
data_two = {"Name": ["Christy", "Misty", "Shristy"],
        "Age": [23, 20,35],
        "City": ["California", "Texas", "San Francisco"]}

In [172]:
data_one

{'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 18, 38],
 'City': ['New York', 'Los Angeles', 'Chicago']}

In [173]:
data_two

{'Name': ['Christy', 'Misty', 'Shristy'],
 'Age': [23, 20, 35],
 'City': ['California', 'Texas', 'San Francisco']}

In [174]:
df_one = pd.DataFrame(data_one)
df_one

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [175]:
df_two = pd.DataFrame(data_two)
df_two

      Name  Age           City
0  Christy   23     California
1    Misty   20          Texas
2  Shristy   35  San Francisco

In [176]:
# Concatenating DataFrames using rows.

pd.concat([df_one, df_two])

      Name  Age           City
0    Alice   25       New York
1      Bob   18    Los Angeles
2  Charlie   38        Chicago
0  Christy   23     California
1    Misty   20          Texas
2  Shristy   35  San Francisco

In [177]:
# Concatenating DataFrames using columns.

pd.concat([df_one, df_two], axis=1)

      Name  Age         City     Name  Age           City
0    Alice   25     New York  Christy   23     California
1      Bob   18  Los Angeles    Misty   20          Texas
2  Charlie   38      Chicago  Shristy   35  San Francisco

Merging Dataframes using common column in both data frames

In [178]:
data_m1 = {"Name": ["Alice", "Bob", "Charlie"],
        "Age": [25, 18,38],
        "City": ["New York", "Los Angeles", "Chicago"]}

In [179]:
data_m2 = {"Name": ["Alice", "Bob", "Charlie"],
        "Country": ["USA", "US", "United States of America"]}

In [180]:
pd_m1 = pd.DataFrame(data_m1)
pd_m1

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [181]:

pd_m2 = pd.DataFrame(data_m2)
pd_m2

      Name                   Country
0    Alice                       USA
1      Bob                        US
2  Charlie  United States of America

In [182]:
# Merging DataFrames using common column in both data frames
pd.merge(pd_m1, pd_m2, on="Name")

      Name  Age         City                   Country
0    Alice   25     New York                       USA
1      Bob   18  Los Angeles                        US
2  Charlie   38      Chicago  United States of America

Data Cleaning Techniques

It is essential crucial step in data pre-processing phase
ensuring data integrity and accuracy for further analysis.

In [183]:
# Removing duplicate rows from DataFrame

data = {"Name": ["Alice", "Bob", "Charlie", "Alice"],
        "Age": [25, 18, 38, 25],
        "City": ["New York", "Los Angeles", "Chicago", "New York"]}

In [184]:
df_dupl = pd.DataFrame(data)

df_dupl

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago
3    Alice   25     New York

In [185]:
# Duplicates are removed based on all rows by default using drop_duplicates method.

df_dupl.drop_duplicates()

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [186]:
df_dupl.duplicated()
# This returns a Series indicating whether each row is a duplicate (True) or not (False).

0    False
1    False
2    False
3     True
dtype: bool

In [187]:
df_dupl.duplicated().sum()
# This returns the total count of duplicate rows in the DataFrame.

np.int64(1)

In [188]:
int(df_dupl.duplicated().sum())
# This converts the count of duplicate rows to an integer from numpy integer type.

1

In [189]:
df_dupl

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago
3    Alice   25     New York

In [190]:
df_dupl.drop_duplicates(subset=["Name","Age"])

      Name  Age         City
0    Alice   25     New York
1      Bob   18  Los Angeles
2  Charlie   38      Chicago

In [191]:
data_nums = {'A': [1, 2, 2, 3, 3],'B': [4, 5, 5, 6, 7]}

In [192]:
df_num_dup = pd.DataFrame(data_nums)

df_num_dup
# This creates a DataFrame with numeric data.

   A  B
0  1  4
1  2  5
2  2  5
3  3  6
4  3  7

In [193]:
df_num_dup.drop_duplicates()
# This removes duplicate rows based on all columns by default.

   A  B
0  1  4
1  2  5
3  3  6
4  3  7

In [194]:
df_num_dup.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [195]:
int(df_num_dup.duplicated().sum())

1

In [196]:
df_num_dup

   A  B
0  1  4
1  2  5
2  2  5
3  3  6
4  3  7

In [197]:
df_num_dup.drop_duplicates(subset=["A"])
# This removes duplicate rows based on the specified column "A". 
# Only 1st occurrence of each unique value in column "A" is retained.

   A  B
0  1  4
1  2  5
3  3  6

In [198]:
df_num_dup.drop_duplicates(subset=["B"])

   A  B
0  1  4
1  2  5
3  3  6
4  3  7

In [199]:
df_num_dup

   A  B
0  1  4
1  2  5
2  2  5
3  3  6
4  3  7

In [200]:
df_num_dup.describe()

             A         B
count  5.00000  5.000000
mean   2.20000  5.400000
std    0.83666  1.140175
min    1.00000  4.000000
25%    2.00000  5.000000
50%    2.00000  5.000000
75%    3.00000  6.000000
max    3.00000  7.000000

Calculating quantile range == Interquartile range (IQR) => 75th percentage - 25th percentage

In [201]:
quantile_25 = df_num_dup["B"].quantile(0.25)
# This calculates the 25th percentile (Q1) of the values in column "B".

In [202]:
quantile_75 = df_num_dup["B"].quantile(0.75)
# This calculates the 75th percentile (Q3) of the values in column "B".

In [203]:
quantile_range_iqr = quantile_75 - quantile_25
# This calculates the interquartile range (IQR) by subtracting Q1 from Q3.

In [204]:
float(quantile_range_iqr)

1.0

Pandas - Lower Bound and Upper Bound in Outliers

Lower bound and upper bound are to decide what counts as outliers. 

Common method is using InterQuantile Range (IQR)

Steps to detect outliers using IQR:

A. Find Q1 and Q3 - 25% of data and 75% of data

B. IQR = Q3 - Q1

C. Set Bounds: 

Lower Bound = Q1 - 1.5 x IQR

Upper Bound = Q2 - 1.5 x IQR


D. Any value beyond the lower bound or upper bound is an outlier.

Inventor: John Turkey

In [205]:
data_outliers = {'A': [1, 2, 2, 3, 11,11],'B': [1, 5, 5, 6, 12,25]}
df_num_outliers = pd.DataFrame(data_outliers)

df_num_outliers
# This creates a DataFrame with numeric data that includes outliers.

    A   B
0   1   1
1   2   5
2   2   5
3   3   6
4  11  12
5  11  25

In [206]:
df_num_outliers.describe()

               A          B
count   6.000000   6.000000
mean    5.000000   9.000000
std     4.690416   8.602325
min     1.000000   1.000000
25%     2.000000   5.000000
50%     2.500000   5.500000
75%     9.000000  10.500000
max    11.000000  25.000000

In [207]:
quantile_25 = df_num_outliers["B"].quantile(0.25)
quantile_25
# This calculates the 25th percentile (Q1) of the values in column "B".

np.float64(5.0)

In [208]:
quantile_75 = df_num_outliers["B"].quantile(0.75)
quantile_75
# This calculates the 75th percentile (Q3) of the values in column "B".

np.float64(10.5)

In [209]:
quantile_range_iqr = quantile_75 - quantile_25
quantile_range_iqr
# This calculates the interquartile range (IQR) by subtracting Q1 from Q3.

np.float64(5.5)

In [210]:
# Finding lower bound for column B 

lower_bound = quantile_25 - 1.5 * quantile_range_iqr
lower_bound

float(lower_bound)

-3.25

In [211]:
# Finding upper bound for column B 

upper_bound = quantile_75 + 1.5 * quantile_range_iqr
upper_bound
float(upper_bound)

18.75

In [212]:
df_num_outliers

# Lower bound for column B = 3.5
# Upper bound for column B = 7.5

    A   B
0   1   1
1   2   5
2   2   5
3   3   6
4  11  12
5  11  25

In [213]:
df_num_outliers_filtered = df_num_outliers[(df_num_outliers["B"] >= lower_bound) & (df_num_outliers["B"] <= upper_bound)]

df_num_outliers_filtered
# This filters the DataFrame to include only rows where the values in column "B" are within the calculated bounds.

# As a result, the outliers (values below -3.25 or above 18.75 in column "B") are removed from the DataFrame.

    A   B
0   1   1
1   2   5
2   2   5
3   3   6
4  11  12

Handling Categorical Data

In [214]:
import pandas as pd

data_category = { 'Flavor' : ['Chocolate','Strawberry','Lemon']}
df_category = pd.DataFrame(data_category)

df_category
# This creates a DataFrame with a single column "Category" containing categorical data.

       Flavor
0   Chocolate
1  Strawberry
2       Lemon

In [215]:
type(df_category)

pandas.core.frame.DataFrame

Using get_dummies() method - pandas function will turn categories into numbers in a smart way

This helps machine learning models understand categorical data.

In [216]:
# Convert categorical column to dummy/indicator variables
encoded_df = pd.get_dummies(df_category, dtype='int')
encoded_df

   Flavor_Chocolate  Flavor_Lemon  Flavor_Strawberry
0                 1             0                  0
1                 0             0                  1
2                 0             1                  0

In [217]:
encoded_df = pd.get_dummies(df_category["Flavor"])[['Chocolate', 'Strawberry', 'Lemon']]
encoded_df

   Chocolate  Strawberry  Lemon
0       True       False  False
1      False        True  False
2      False       False   True

Data Category Techniques

In [218]:
import pandas as pd

data_category = { 'Flavor' : ['Chocolate','Strawberry','Lemon', 'Chocolate', 'Lemon']}
df_category = pd.DataFrame(data_category)

df_category
# This creates a DataFrame with a single column "Category" containing categorical data.

       Flavor
0   Chocolate
1  Strawberry
2       Lemon
3   Chocolate
4       Lemon

In [219]:
df_category.groupby("Flavor").size()
# This groups the DataFrame by the "Flavor" column and counts the occurrences of each unique value.

Flavor
Chocolate     2
Lemon         2
Strawberry    1
dtype: int64

In [220]:
type(df_category.groupby("Flavor").size())

pandas.core.series.Series

In [221]:
df_category.groupby('Flavor').agg({'Flavor': 'count'})

            Flavor
Flavor
Chocolate        2
Lemon            2
Strawberry       1

In [222]:
type(df_category.groupby('Flavor').agg({'Flavor': 'count'}))

pandas.core.frame.DataFrame

In [223]:
# Convert Series to DataFrame
df_category.groupby("Flavor").size().reset_index()

       Flavor  0
0   Chocolate  2
1       Lemon  2
2  Strawberry  1

In [224]:
# Columns are reset to default integer index and the grouped data is converted to a DataFrame.
df_category.groupby("Flavor").size().reset_index(name='Count')

       Flavor  Count
0   Chocolate      2
1       Lemon      2
2  Strawberry      1

In [225]:
# This returns type as DataFrame
type(df_category.groupby("Flavor").size().reset_index())

pandas.core.frame.DataFrame

get_dummies() - for Series

In [226]:
import pandas as pd

# Create a series
data = ['A','B','A','C','B']
data

data_series = pd.Series(data)

data_series
# This creates a Pandas Series from the list `data`.

0    A
1    B
2    A
3    C
4    B
dtype: object

In [227]:
dummies_series = pd.get_dummies(data_series).dtypes

dummies_series
# Get dummies return data type of the series.

A    bool
B    bool
C    bool
dtype: object

In [228]:
# Using get_dummies() on the series

dummies_series = pd.get_dummies(data_series)
dummies_series

       A      B      C
0   True  False  False
1  False   True  False
2   True  False  False
3  False  False   True
4  False   True  False

Data Transformation Techniques

In [229]:
scores = {"Name": ["Alice", "Bob", "Charlie"],
          "Math": [85, 90, 95],
          "Science": [92,80,95]}

scores

df_scores = pd.DataFrame(scores)

df_scores
# This creates a DataFrame from the dictionary `scores`.

      Name  Math  Science
0    Alice    85       92
1      Bob    90       80
2  Charlie    95       95

In [230]:
# Using Melt() to reshape the DataFrame

melt_df_scores = pd.melt(df_scores, id_vars=["Name"], value_vars=["Math", "Science"], var_name="Subject", value_name="Score")

melt_df_scores

# melt() - dataframe, column you want to keep as identifier, columns you want to melt, name for the melted column, name for the melted values.

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     90
2  Charlie     Math     95
3    Alice  Science     92
4      Bob  Science     80
5  Charlie  Science     95

In [231]:
data_panda_eat = {"Name": ["Ronny", "Bella"],
                 "Monday": [10,8],
                 "Tuesday": [12, 6],
                 "Wednesday": [14, 7],
                 "Thursday": [11, 5],
                 "Friday" : [13, 9],
                 "Saturday": [15, 10],
                 "Sunday": [9, 4]}

data_panda_eat

df_panda_eat = pd.DataFrame(data_panda_eat)
df_panda_eat

    Name  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
0  Ronny      10       12         14        11      13        15       9
1  Bella       8        6          7         5       9        10       4

In [232]:
# Using melt() to reshape the DataFrame
# melt() - dataframe, column you want to keep as identifier, columns you want to melt, name for the melted column, name for the melted values.


melt_df_panda_eat = pd.melt(df_panda_eat, id_vars=["Name"], value_vars=["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"], var_name="Day", value_name="Eats Bamboo")

melt_df_panda_eat

     Name        Day  Eats Bamboo
0   Ronny     Monday           10
1   Bella     Monday            8
2   Ronny    Tuesday           12
3   Bella    Tuesday            6
4   Ronny  Wednesday           14
5   Bella  Wednesday            7
6   Ronny   Thursday           11
7   Bella   Thursday            5
8   Ronny     Friday           13
9   Bella     Friday            9
10  Ronny   Saturday           15
11  Bella   Saturday           10
12  Ronny     Sunday            9
13  Bella     Sunday            4

Pivot() Method in Pandas

In [233]:
melt_df_panda_eat

     Name        Day  Eats Bamboo
0   Ronny     Monday           10
1   Bella     Monday            8
2   Ronny    Tuesday           12
3   Bella    Tuesday            6
4   Ronny  Wednesday           14
5   Bella  Wednesday            7
6   Ronny   Thursday           11
7   Bella   Thursday            5
8   Ronny     Friday           13
9   Bella     Friday            9
10  Ronny   Saturday           15
11  Bella   Saturday           10
12  Ronny     Sunday            9
13  Bella     Sunday            4

In [234]:
pivoted_df = melt_df_panda_eat.pivot(index="Name", columns="Day", values="Eats Bamboo")
pivoted_df
# pivot reshapes the df from long to wide format to pivot table.

Day    Friday  Monday  Saturday  Sunday  Thursday  Tuesday  Wednesday
Name
Bella       9       8        10       4         5        6          7
Ronny      13      10        15       9        11       12         14

In [235]:
# After pivoting, the index is sorted alphabetically by default.

days_order = ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"]

# Unique names from original dataframe.
name_order = df_panda_eat["Name"].unique()

# Pivoting the melted dataframe.
pivoted_df = melt_df_panda_eat.pivot(index="Name", columns="Day", values="Eats Bamboo")

# Sorting the index and columns of the pivoted DataFrame
pivoted_df = pivoted_df.reindex(index=name_order,columns=days_order)
pivoted_df

Day    Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
Name
Ronny      10       12         14        11      13        15       9
Bella       8        6          7         5       9        10       4

Handling Date and Time data in Dataframe

In [236]:
data = {
    'Date' : ['2023-01-01', '2023-01-02', '2023-01-03'],
    'Sales' : [100, 150, 200],
    'Profit' : [20, 30, 50]
}

df_data = pd.DataFrame(data)

df_data

         Date  Sales  Profit
0  2023-01-01    100      20
1  2023-01-02    150      30
2  2023-01-03    200      50

In [237]:
df_data.dtypes
# Date data type is object.

Date      object
Sales      int64
Profit     int64
dtype: object

In [238]:
df_data['Date'] = pd.to_datetime(df_data['Date'])

df_data.dtypes
# Now the Date data type is datetime64[ns]

Date      datetime64[ns]
Sales              int64
Profit             int64
dtype: object

In [239]:
df_data

        Date  Sales  Profit
0 2023-01-01    100      20
1 2023-01-02    150      30
2 2023-01-03    200      50

In [240]:
# Now converting datetime column to date parts -  Month, Day, Year

df_data['Year'] = df_data['Date'].dt.year
df_data['Month'] = df_data['Date'].dt.month
df_data['Day'] = df_data['Date'].dt.day

In [241]:
df_data

        Date  Sales  Profit  Year  Month  Day
0 2023-01-01    100      20  2023      1    1
1 2023-01-02    150      30  2023      1    2
2 2023-01-03    200      50  2023      1    3

Time Series - Data
- Sequence of Data Points collected or recorded at regular time intervals

Ex: Weather Data, Sales Data, Stock Prices, Sensor Recordings.

- Each Observation is associated with a timestamp
- Data is ordered chronologically = arranged in order of time (earliest to latest or viceversa)

In [242]:
import pandas as pd

data = {
    'Date' : ['2023-01-03', '2023-01-02', '2023-01-01'],
    'Sales' : [100, 150, 200],
    'Profit' : [20, 30, 50]
}

df_data = pd.DataFrame(data)
df_data

         Date  Sales  Profit
0  2023-01-03    100      20
1  2023-01-02    150      30
2  2023-01-01    200      50

In [243]:
df_data['Date'] = pd.to_datetime(df_data['Date'])
df_data

        Date  Sales  Profit
0 2023-01-03    100      20
1 2023-01-02    150      30
2 2023-01-01    200      50

In [244]:
df_data.set_index('Date', inplace=True)
df_data

            Sales  Profit
Date
2023-01-03    100      20
2023-01-02    150      30
2023-01-01    200      50

In [245]:
df_data = df_data.sort_values('Date')
df_data

            Sales  Profit
Date
2023-01-01    200      50
2023-01-02    150      30
2023-01-03    100      20

Common Time Series Operations

Mean - Average of all values in the month

In [246]:
df_data.resample('ME').mean()
# ME stands for Month End frequency.
# This resamples the DataFrame to a monthly frequency and calculates the mean for each month.

            Sales     Profit
Date
2023-01-31  150.0  33.333333

In [247]:
df_data.resample('MS').mean()

# Mean = Average of all values in the month.
# MS stands for Month Start frequency.
# This resamples the DataFrame to a monthly frequency and calculates the mean for each month.

            Sales     Profit
Date
2023-01-01  150.0  33.333333

In [248]:
df_data.resample('QE').mean()
# QE stands for Quarter End frequency.

            Sales     Profit
Date
2023-03-31  150.0  33.333333

In [249]:
df_data.resample('QS').mean()
# QS stands for Quarter Start frequency.

            Sales     Profit
Date
2023-01-01  150.0  33.333333

In [250]:
df_data.resample('YE').mean()
# YE stands for Year End frequency.

            Sales     Profit
Date
2023-12-31  150.0  33.333333

In [251]:
df_data_resampled = df_data.resample('YS').mean()
df_data_resampled
# YS stands for Year Start frequency.

            Sales     Profit
Date
2023-01-01  150.0  33.333333

Filtering by Date

In [252]:
df_data['2023-01-01':'2023-01-02']


# slicing: df_data['start_date':'end_date']
# This slice returns both start_date and end_date rows.

            Sales  Profit
Date
2023-01-01    200      50
2023-01-02    150      30

Shift

In [253]:
df_data["Shifted Sales"] = df_data['Sales'].shift(1)
df_data
# This creates a new column "Shifted Sales" by shifting the "Sales" column down by 1 row.

            Sales  Profit  Shifted Sales
Date
2023-01-01    200      50            NaN
2023-01-02    150      30          200.0
2023-01-03    100      20          150.0

In [254]:
df_data["Sales Change"] = df_data['Sales'] - df_data['Shifted Sales']
df_data

            Sales  Profit  Shifted Sales  Sales Change
Date
2023-01-01    200      50            NaN           NaN
2023-01-02    150      30          200.0         -50.0
2023-01-03    100      20          150.0         -50.0

In [255]:
df_data["Lagged Sales"] = df_data['Sales'].shift(-1)
df_data
# This creates a new column "Lagged Sales" by shifting the "Sales" column up by 1 row.

            Sales  Profit  Shifted Sales  Sales Change  Lagged Sales
Date
2023-01-01    200      50            NaN           NaN         150.0
2023-01-02    150      30          200.0         -50.0         100.0
2023-01-03    100      20          150.0         -50.0           NaN

In [256]:
df_data["Sales Predict"] = df_data['Sales'] - df_data['Lagged Sales']
df_data
# This creates a new column "Sales Predict" by calculating the difference between the "Sales" column and the "Lagged Sales" column.
# This is used to predict the sales for the next period based on the current sales data.

,Sales,Profit,Shifted Sales,Sales Change,Lagged Sales,Sales Predict
Date,,,,,,
2023-01-01,200,50,NaN,NaN,150.0,50.0
2023-01-02,150,30,200.0,-50.0,100.0,50.0
2023-01-03,100,20,150.0,-50.0,NaN,NaN

Time Series Data with Another Time Series Data

- pd.date_range is a pandas function to generate a range of dates.
- '2023-01-01' is the start date.
- periods=6 means you want 6 dates.
- freq='D' means daily frequency (each date is one day apart).

Format: pd.date_range(start, periods, freq)

In [257]:
time_index = pd.date_range('2023-01-01', periods=6, freq='D')
time_index
# This creates a date range starting from '2023-01-01' for 6 periods with a daily frequency.

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', freq='D')

In [258]:
time_index = pd.date_range('2025-08-01', periods=10, freq='W')
time_index
# This creates a date range starting from '2025-08-01' for 10 periods with a weekly frequency.

DatetimeIndex(['2025-08-03', '2025-08-10', '2025-08-17', '2025-08-24',
               '2025-08-31', '2025-09-07', '2025-09-14', '2025-09-21',
               '2025-09-28', '2025-10-05'],
              dtype='datetime64[ns]', freq='W-SUN')

In [259]:
time_index = pd.date_range('2025-08-01', periods=10, freq='W-MON')
time_index
# This creates a date range starting from '2025-08-01' for 10 periods with a weekly frequency on Mondays.

DatetimeIndex(['2025-08-04', '2025-08-11', '2025-08-18', '2025-08-25',
               '2025-09-01', '2025-09-08', '2025-09-15', '2025-09-22',
               '2025-09-29', '2025-10-06'],
              dtype='datetime64[ns]', freq='W-MON')

In [260]:
time_index = pd.date_range('2025-01-01', periods=5, freq='YS')
time_index
# This creates a date range starting from '2025-01-01' for 5 periods with a yearly frequency.

DatetimeIndex(['2025-01-01', '2026-01-01', '2027-01-01', '2028-01-01',
               '2029-01-01'],
              dtype='datetime64[ns]', freq='YS-JAN')

In [261]:
time_index = pd.date_range('2023-01-01', periods=6, freq='D')
tS_data = pd.Series([100,150,200,250,300,350], index=time_index)
tS_data

2023-01-01    100
2023-01-02    150
2023-01-03    200
2023-01-04    250
2023-01-05    300
2023-01-06    350
Freq: D, dtype: int64

Time Series - Resample

In [262]:
ts_resample = tS_data.resample('D').mean()
ts_resample
# This resamples the time series data to a daily frequency and calculates the mean for each day

2023-01-01    100.0
2023-01-02    150.0
2023-01-03    200.0
2023-01-04    250.0
2023-01-05    300.0
2023-01-06    350.0
Freq: D, dtype: float64

Group By Operations
- Useful for aggregating and analyzing the data based on specific criteria.

In [264]:
data_cat_value = {'Category': ['A','B','A','B','A'],
                  'Value': [10,20,30,40,50]}

df_cat_value = pd.DataFrame(data_cat_value)
df_cat_value

  Category  Value
0        A     10
1        B     20
2        A     30
3        B     40
4        A     50

In [266]:
# Grouping by Category and calculating sum of Values
df_cat_value.groupby("Category").sum()

# This groups the category column and sums the values

          Value
Category
A            90
B            60

In [268]:
df_cat_value.groupby("Category").mean()
# This groups the category column and calculates the mean of the values
# A - 90/3 = 30, B - 60/2 = 30

          Value
Category
A          30.0
B          30.0

In [270]:
df_cat_value.groupby("Category").median()
# This groups the category column and calculates the median of the values

# A - 10, 30, 50 -> 30
# B - 20, 40 -> 20+40/2 = 30

          Value
Category
A          30.0
B          30.0

In [274]:
df_cat_value.groupby("Category").max()
# This groups the category column and finds the maximum value in each group

# A - 10, 30, 50 -> 50
# B - 20, 40 -> 40

          Value
Category
A            50
B            40

In [273]:
df_cat_value.groupby("Category").min()
# This groups the category column and finds the minimum value in each group

# A - 10, 30, 50 -> 10
# B - 20, 40 -> 20

          Value
Category
A            10
B            20

In [279]:
df_cat_value.groupby("Category").std()
# This groups the category column and calculates the standard deviation of the values in each group.

# For std() it uses the formula.
# Standard Deviation = sqrt( Σ ( xi - x̄ )² / ( N - 1 ) )
# where: xi represents each value in the dataset,
# x̄ is the mean of the dataset,
# N is the number of values in the dataset,
# Σ is the summation symbol, indicating that you sum over all values.
# sqrt is the square root function.

              Value
Category
A         20.000000
B         14.142136

In [278]:
df_cat_value.groupby("Category").var()
# This groups the category column and calculates the variance of the values in each group.

# For var() it uses the formula.
# Formula = sum((x - mean)^2) / (n - 1)
# where x is each value, mean is the average of the values, and n is the number of values.

          Value
Category
A         400.0
B         200.0

In [281]:
# Applying multiple aggregation functions.

df_cat_value.groupby("Category").agg(['sum', 'mean', 'max', 'min', 'std', 'var'])

         Value
           sum  mean max min        std    var
Category
A           90  30.0  50  10  20.000000  400.0
B           60  30.0  40  20  14.142136  200.0

Aggregate Data using Various Functions

In [282]:
data_cat_value = {'Category': ['A','B','A','B','A'],
                  'Value': [10,20,30,40,50]}

df_cat_value = pd.DataFrame(data_cat_value)
df_cat_value

  Category  Value
0        A     10
1        B     20
2        A     30
3        B     40
4        A     50

In [288]:
# Applying multiple aggregation functions.
df_cat_value.groupby("Category").agg(['sum', 'mean', 'max', 'min', 'std', 'var'])

         Value
           sum  mean max min        std    var
Category
A           90  30.0  50  10  20.000000  400.0
B           60  30.0  40  20  14.142136  200.0

In [289]:
# Applying single aggregation function with dictionary format.
df_cat_value.groupby("Category").agg({"Value": "sum"})

          Value
Category
A            90
B            60

In [290]:
# Applying single aggregation function with dictionary format.
df_cat_value.groupby("Category").agg({"Value": "mean"})

          Value
Category
A          30.0
B          30.0

In [291]:
# Applying single aggregation function with dictionary format.
df_cat_value.groupby("Category").agg({"Value": "median"})

          Value
Category
A          30.0
B          30.0

In [295]:
# Applying single aggregation function with dictionary format.
df_cat_value.groupby("Category").agg({"Value": "min"})

          Value
Category
A            10
B            20

Custom Aggregation Functions

In [296]:
data_cat_value = {'Category': ['A','B','A','B','A'],
                  'Value': [10,20,30,40,50]}

df_cat_value = pd.DataFrame(data_cat_value)
df_cat_value

  Category  Value
0        A     10
1        B     20
2        A     30
3        B     40
4        A     50

In [298]:
# Defining a custom function.

def range_func(x):
    return x.max() - x.min()

result =df_cat_value.groupby("Category").agg({"Value": range_func})
# This applies the custom function `range_func` to the "Value" column for each group
result

          Value
Category
A            40
B            20

In [299]:
# Defining a custom aggregation function with lambda function

df_cat_value.groupby("Category").agg({"Value": lambda x: x.max() - x.min()})
# This applies a lambda function to calculate the range (max - min) of the "Value" column for each group.
# Lambda functions are small anonymous functions defined using the lambda keyword.

          Value
Category
A            40
B            20

In [301]:
# Using a variable to store the lambda function
custom_agg = lambda x: x.max() - x.min()

df_cat_value.groupby("Category").agg({"Value": custom_agg})
# This applies the custom aggregation function `custom_agg` to the "Value" column for

          Value
Category
A            40
B            20

Applying multiple aggregation functions

In [302]:
data_cat_value = {'Category': ['A','B','A','B','A'],
                  'Value': [10,20,30,40,50]}

df_cat_value = pd.DataFrame(data_cat_value)
df_cat_value

  Category  Value
0        A     10
1        B     20
2        A     30
3        B     40
4        A     50

In [306]:
# This aggregates multiple functions only on "Value" column.
# Result is Category as Index and listed functions as columns - "Values"
df_cat_value.groupby("Category")["Value"].agg(['sum', 'mean', 'max', 'min', 'std', 'var'])

          sum  mean  max  min        std    var
Category
A          90  30.0   50   10  20.000000  400.0
B          60  30.0   40   20  14.142136  200.0

In [307]:
# This aggregates multiple functions on all numeric columns.
df_cat_value.groupby("Category").agg(['sum', 'mean', 'max', 'min', 'std', 'var'])

         Value
           sum  mean max min        std    var
Category
A           90  30.0  50  10  20.000000  400.0
B           60  30.0  40  20  14.142136  200.0

In [315]:
def custom_func_mean(values):
    return sum(values) / len(values)


df_cat_value.groupby("Category")["Value"].agg(custom_func_mean)
# This applies the custom function `custom_func_mean` to the "Value" column for each

Category
A    30.0
B    30.0
Name: Value, dtype: float64

In [316]:
df_cat_value.groupby("Category").agg({"Value": custom_func_mean})
# This applies the custom function `custom_func_mean` to the "Value" column for each

          Value
Category
A          30.0
B          30.0